"""
Відповідно до способів взаємодії мережею, програми можна поділити на дві категорії:

1. без встановлення з'єднання (протокол UDP)
2. із встановленням з'єднання (протокол TCP)

Протоколи UDP та TCP працюють поверх мережевого IP-протоколу. Вони більше відомі під загальною назвою — стек протоколів
TCP/IP
При передачі даних мережею завжди потрібно пам'ятати, що обмін відбувається сокетами (байтовими даними) і необхідно
виконувати кодування та декодування даних.

У Python для обміну даними мережею використовують модуль socket, який надає інтерфейс для роботи із сокетами.

Цей модуль надає великий набір констант для конфігурації екземплярів сокетів. Найзначущі наступні константи

                        AF_INET         сокет працюватиме з адресами IPv4
                        AF_INET6        сокет працюватиме з адресами IPv6
                        SOCK_STREAM     сокет працюватиме за протоколом TCP
                        SOCK_DGRAM      сокет працюватиме за протоколом UDP
"""